Repository: GamemakerChina/GmlSpec-CN
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: With this function you can change the playback speed of the given sequence.
zh_cn: 通过此函数，您可以改变给定序列的播放速度。

source: With this function you can change the position and/or the speed factor of any point previously defined for a path (the path can have been created in the path editor or through code using path_add()).
zh_cn: 通过此函数，您可以更改之前为路径定义的任何点的位置和/或速度系数(路径可以在路径编辑器中创建，也可以通过使用path_add()的代码创建)。

source: With this function you can change the position of a given listener within the 3D audio space.
zh_cn: 通过此函数，你可以在3D音频空间中改变给定的位置。

source: With this function you can change the position of an audio emitter within the 3D audio space.
zh_cn: 通过此函数，您可以更改音频发射器在3D音频空间中的位置。

source: With this function you can change the position of the listener within the 3D audio space.
zh_cn: 通过此函数，你可以在3D音频空间中改变的位置。

source: With this function you can change the size of the game window.
zh_cn: 通过此函数，你可以改变游戏窗口的大小。

source: With this function you can change the sprite and position of a clickable icon previously created with clickable_add().
zh_cn: 通过此函数，你可以改变之前用clickable_add()创建的可点击图标的精灵和位置。

source: With this function you can change the value for the given key within the a DS map .
zh_cn: 通过此函数，您可以更改DS map中给定键的值。

source: With this function you can change whether mipmapping is switched off, switched on for everything, or switched on only for texture groups selected in the Texture Group Manager.
zh_cn: 通过此函数，你可以改变mpmapping是关闭的，还是对所有事物都打开，或者只对纹理组管理器中选择的纹理组打开。

source: With this function you can check a datetime value to see if it is valid (returns true) or not (returns false).
zh_cn: 使用此函数，您可以检查一个日期时间值，看它是有效的(返回true)还是无效的(返回false)。

source: With this function you can check a position for a collision with all instances of an object using the collision mask of the instance that runs the code for the check.
zh_cn: 通过此函数，您可以使用运行检查代码的实例的碰撞遮罩来检查与对象的所有实例的碰撞位置。

source: With this function you can check a position for a collision with all instances of another object.
zh_cn: 通过此函数，您可以检查与另一个对象的所有实例发生碰撞的位置。

source: With this function you can check a position for a collision with another instance or all instances of an object using the collision mask of the instance that runs the code for the check.
zh_cn: 通过此函数，您可以使用运行检查代码的实例的碰撞遮罩，检查与另一个实例或对象的所有实例的碰撞位置。

source: With this function you can check a position for a collision with another instance or all instances of an object.
zh_cn: 通过此函数，您可以检查与另一个实例或对象的所有实例发生碰撞的位置。

source: With this function you can check and see if the origin of an instance (its x and y position) is aligned to a grid with the hsnap and vsnap values specified by you.
zh_cn: 使用此函数，您可以检查并查看实例的原点(其x和y位置)是否与具有您指定的hsnap和vsnap值的网格对齐。

source: With this function you can check and see if your device currently has an internet connection and it will return true if it does, or false if it does not, and depending on the OS, it may attempt to make a connection before returning a value.
zh_cn: 通过此函数，您可以检查并查看您的设备当前是否有互联网连接，如果有，它将返回true，如果没有，则返回false，并且根据操作系统，它可能会在返回值之前尝试建立连接。

source: With this function you can check and see whether a time line exists (returns true) or not (returns false).
zh_cn: 通过此函数，您可以检查并查看时间线是否存在(返回true)或不存在(返回false)。

source: With this function you can check and see whether the room you specify exists or not.
zh_cn: 通过此函数，你可以检查你指定的房间是否存在。

source: With this function you can check any font asset to see if it has the bold flag or not.
zh_cn: 通过此函数，你可以检查任何字体资源，看看它是否有粗体标志。

source: With this function you can check any font asset to see if it has the italic flag or not.
zh_cn: 通过此函数，你可以检查任何字体资源，看看它是否有斜体标志。

source: With this function you can check any given cell of the mp_grid to see if it has been flagged as occupied or not, giving the index of the (previously created) mp_grid and the x an y coordinates of the cell to check.
zh_cn: 使用此函数，您可以检查mp_grid的任何给定单元格，查看它是否被标记为已占用，给出(先前创建的)mp_grid的索引和要检查的单元格的x和y坐标。

source: With this function you can check if all of the elements return true to the given predicate.
zh_cn: 使用此函数，您可以检查是否所有元素都对给定的条件下返回true。

source: With this function you can check if any of the elements returns true to the given predicate.
zh_cn: 使用此函数，您可以检查是否有任何元素对给定条件下返回 true。

source: With this function you can check the given DS list to see if it is empty (returns true) or not (returns false).
zh_cn: 通过此函数，你可以检查给定的DS列表，看看它是空的(返回true)还是空的(返回false)。

source: With this function you can check the given DS priority queue to see if it is empty (returns true) or not (returns false).
zh_cn: 通过此函数，你可以检查给定的DS优先队列，看看它是空的(返回true)还是空的(返回false)。

source: With this function you can check the given DS queue to see if it is empty (returns true) or not (returns false).
zh_cn: 使用此函数，您可以检查给定的DS队列，看它是空的(返回true)还是不空的(返回false)。

source: With this function you can check the given DS stack to see if it is empty (returns true) or not (returns false).
zh_cn: 通过此函数，你可以检查给定的DS堆栈，看看它是空的(返回true)还是空的(返回false)。

source: With this function you can check the given list for a value and the position within the list for that value will be returned.
zh_cn: 使用此函数，你可以检查给定列表中的一个值，并返回该值在列表中的位置。

source: With this function you can check the given list position and the value held within the list for that position will be returned.
zh_cn: 通过此函数，你可以检查给定的列表位置，并返回该位置在列表中的值。

source: With this function you can check the weak reference to a struct to see if it is still "alive" or not.
zh_cn: 使用此函数，您可以检查对结构的弱引用，看看它是否仍然是"活动的"。

source: With this function you can check the weak reference to various structs to see if it they are still "alive" or not.
zh_cn: 使用此函数，你可以检查对各种结构的弱引用，看看它们是否仍然"存活"。

source: With this function you can check to see if a DS list is stored in the given map key.
zh_cn: 通过此函数，您可以查看DS列表是否存储在给定的map键中。

source: With this function you can check to see if a DS map is stored at the given position within a DS list.
zh_cn: 通过此函数，您可以检查DS map是否存储在DS列表中的给定位置。

source: With this function you can check to see if a DS map is stored in the given map key.
zh_cn: 通过此函数，您可以查看DS map是否存储在给定的map键中。

source: With this function you can check to see if a data structure of the given type exists.
zh_cn: 使用此函数，您可以检查给定类型的数据结构是否存在。

source: With this function you can check to see if a key has been pressed or not.
zh_cn: 通过此函数，你可以检查一个键是否被按下。

source: With this function you can check to see if a key has been released or not.
zh_cn: 通过此函数，你可以检查一个密钥是否已经被释放。

source: With this function you can check to see if a key is held down or not.
zh_cn: 通过此函数，您可以查看某个键是否被按下。

source: With this function you can check to see if a particle system currently has any particles created in the room, and it will return the number of them too.
zh_cn: 使用此函数，你可以查看一个粒子系统当前是否有任何粒子在房间中被创建，并且它也将返回它们的数量。

source: With this function you can check to see if a sequence element exists on the given layer.
zh_cn: 通过此函数，你可以检查给定层上是否存在序列元素。

source: With this function you can check to see if a sequence object exists or not.
zh_cn: 使用此函数，您可以检查序列对象是否存在。

source: With this function you can check to see if a specific permission has been granted to the game by the user.
zh_cn: 通过此函数，你可以查看用户是否授予了游戏特定的权限。

source: With this function you can check to see if a specific value (real or string) is present within a circular area of a given DS grid.
zh_cn: 使用此函数，你可以检查一个特定的值(实数或字符串)是否出现在一个给定的DS网格的圆形区域内。

source: With this function you can check to see if a specific value (real or string) is present within a rectangular area of a given DS grid.
zh_cn: 使用此函数，您可以检查特定的值(实数或字符串)是否出现在给定DS网格的矩形区域内。

source: With this function you can check to see if another DS list is stored at the given position within a DS list.
zh_cn: 通过此函数，您可以查看在DS列表中的给定位置是否存储了另一个DS列表。

source: With this function you can check to see if one or more tag strings is assigned to any asset from the asset browser.
zh_cn: 使用此函数，您可以检查是否有一个或多个标记字符串被分配给资源浏览器中的任何资源。

source: With this function you can check to see if the garbage collector is enabled or not.
zh_cn: 通过此函数，您可以检查垃圾收集器是否被启用。

source: With this function you can check to see if the given particle emitter indexed exists in the given system or not.
zh_cn: 通过此函数，您可以查看给定粒子发射器索引是否存在于给定系统中。

source: With this function you can check to see if the given particle system indexed exists in the game or not.
zh_cn: 通过此函数，你可以检查给定的粒子系统索引是否存在于游戏中。

source: With this function you can check to see if the given particle type indexed exists in the game or not.
zh_cn: 通过此函数，你可以检查给定的粒子类型是否存在于游戏中。

source: With this function you can check to see if two arrays are equal (equivalent or the same).
zh_cn: 使用此函数，你可以检查两个数组是否相等(等价或相同)。

source: With this function you can check to see whether alpha testing is enabled (returns true) or not (returns false).
zh_cn: 使用此函数，您可以检查alpha测试是否启用(返回true)或不启用(返回false)。

source: With this function you can check to see whether texture filtering (linear interpolation) is enabled (returns true) or not (returns false).
zh_cn: 通过此函数，您可以查看纹理过滤(线性插值)是否已启用(返回true)或未启用(返回false)。

source: With this function you can check to see whether texture interpolation (linear interpolation) is enabled (returns true) or not (returns false) for a given shader sampler texture.
zh_cn: 使用此函数，您可以检查给定着色器采样器纹理是否启用了纹理插值(线性插值)(返回true)或未启用(返回false)。

source: With this function you can check to see whether texture repeating is enabled (returns true) or not (returns false) for a given shader sampler texture.
zh_cn: 使用此函数，您可以检查给定着色器采样器纹理是否启用了纹理重复(返回true)或未启用(返回false)。

source: With this function you can check to see whether texture repeating is enabled (returns true) or not (returns false).
zh_cn: 使用此函数，你可以检查纹理重复是否被激活(返回真)或者不被激活(返回假)。

source: With this function you can check two dates and times to see which one has the time component earlier or later than the other.
zh_cn: 使用此函数，您可以检查两个日期和时间，看哪一个的时间部分比另一个早或晚。

source: With this function you can check two dates and times to see which one is the earlier or later than the other.
zh_cn: 通过此函数，您可以检查两个日期和时间，看哪一个比另一个早或晚。

source: With this function you can check two dates to see which one is the earlier or later than the other.
zh_cn: 通过此函数，您可以检查两个日期，看哪一个比另一个早或晚。

source: With this function you can check whether a global scope variable exists or not.
zh_cn: 使用此函数，您可以检查全局作用域变量是否存在。

source: With this function you can check whether a layer is visible or not.
zh_cn: 通过此函数，您可以检查一个层是否可见。

source: With this function you can check whether a variable exists within the given struct or not.
zh_cn: 使用此函数，您可以检查给定结构中是否存在变量。

source: With this function you can check whether an instance scope variable exists or not.
zh_cn: 使用此函数，您可以检查实例作用域变量是否存在。

source: With this function you can choose to enable (true) or disable (false) the draw event for all instances in the game, thus giving you control over how and when things are draw, useful if you wish to implement a "frame skip" technique.
zh_cn: 通过此函数，你可以选择为游戏中的所有实例启用(true)或禁用(false)绘制事件，这样你就可以控制绘制的方式和时间，如果你想实现"帧跳过"技术，这很有用。

source: With this function you can clear a specific moment of any previously defined time line of all codes and actions.
zh_cn: 通过此函数，您可以清除任何先前定义的时间线的特定时刻的所有代码和动作。

source: With this function you can clear a specific time line of "moments", removing all codes and actions for that time line and leaving it empty.
zh_cn: 通过此函数，你可以清除一个特定的时间线的"时刻"，删除所有的代码和操作的时间线，并保持空。

source: With this function you can clear all data from the given list data-structure.
zh_cn: 使用此函数，你可以从给定的列表数据结构中清除所有数据。

source: With this function you can clear all data from the given priority queue data-structure.
zh_cn: 使用此函数，您可以从给定的优先级队列数据结构中清除所有数据。

source: With this function you can clear all data from the given queue data-structure.
zh_cn: 通过此函数，您可以清除给定队列数据结构中的所有数据。

source: With this function you can clear all data from the given stack data-structure.
zh_cn: 使用此函数，你可以从给定的堆栈数据结构中清除所有数据。

source: With this function you can clear all re-mapped keys so that they return to their default state, ie: all keys to map to themselves.
zh_cn: 通过此函数，你可以清除所有重新映射的键，使它们返回到默认状态，即:所有键映射到自己。

source: With this function you can clear all the particles currently created by the system from the room.
zh_cn: 通过此函数，您可以从房间中清除系统当前创建的所有粒子。

source: With this function you can clear all the tags present on any asset from the asset browser.
zh_cn: 通过此函数，您可以从资源浏览器中清除任何资源上的所有标记。

source: With this function you can clear an MP grid of all "forbidden" cells.
zh_cn: 通过此函数，您可以清除MP网格中的所有"禁用"单元格。

source: With this function you can clear the current keyboard state, which essentially means that if the key is being held down, it will no longer be recognised until it is released again (which won't trigger the Keyboard Key Released event either on this occasion) and pressed again. The function will take a keycode value as returned by the function ord() (only capital letters from A-Z or numbers from 0-9), or any of the vk_* constants listed on the main Keyboard Input page.
zh_cn: 通过此函数，你可以清除当前的键盘状态，这基本上意味着，如果键被按住，它将不再被识别，直到它再次释放(这也不会触发键盘键释放事件在这种情况下)，并再次按下。此函数将接受ord()函数返回的keycode值(只接受a - z中的大写字母或0-9中的数字)，或主键盘输入页面中列出的任何vk_*常量。

source: With this function you can clear the given emitter from the specified particle system back to its default state.
zh_cn: 通过此函数，您可以将指定粒子系统中的给定发射器清除回其默认状态。

source: With this function you can clear the indexed system to its default state, removing all emitters and resetting the depth and position (if they had been changed).
zh_cn: 使用此函数，您可以将索引系统清除到默认状态，删除所有发射器并重置深度和位置(如果它们已经更改过)。

source: With this function you can clear the internal global high score list, resetting all names to the default value of "Unknown" and all scores to the default value of 0.
zh_cn: 通过此函数，您可以清除内部全局高分列表，将所有姓名重置为默认值"未知"，并将所有分数重置为默认值0。

source: With this function you can command an instance to bounce off all instances within the room, with the only exception being those that have no sprite or mask index assigned to them.
zh_cn: 通过此函数，你可以命令一个实例从房间内的所有实例中反弹，唯一的例外是那些没有分配给它们的精灵或掩码索引。

source: With this function you can command an instance to bounce off only those instances marked as solid within the room.
zh_cn: 通过此函数，您可以命令一个实例只反射房间内标记为固体的实例。

source: With this function you can compress part (or all) of a buffer using zlib compression.
zh_cn: 通过此函数，你可以使用zlib压缩来压缩部分(或全部)缓冲区。

source: With this function you can concatenate two or more arrays into a single one.
zh_cn: 使用这个函数，您可以将两个或多个数组连接成一个数组。

source: With this function you can configure how texture group loading is handled as well as set debug options
zh_cn: 通过此函数，你可以配置如何处理纹理组加载以及设置调试选项

source: With this function you can convert single or nested structs and arrays into a valid JSON string.
zh_cn: 通过此函数，您可以将单个或嵌套的结构和数组转换为有效的JSON字符串。

source: With this function you can copy all or part of an array into another array at any position.
zh_cn: 使用此函数，你可以将一个数组的全部或部分复制到另一个数组的任意位置。

source: With this function you can copy the contents of one grid into another one.
zh_cn: 通过此函数，您可以将一个网格的内容复制到另一个网格中。

source: With this function you can copy the contents of one list into another.
zh_cn: 通过此函数，您可以将一个列表的内容复制到另一个列表中。

source: With this function you can copy the given MP grid into a DS grid.
zh_cn: 通过此函数，您可以将给定的MP网格复制到DS网格中。

source: With this function you can copy the path data from one path to another.
zh_cn: 通过此函数，您可以将路径数据从一个路径复制到另一个路径。

source: With this function you can create a 1D array of a given size.
zh_cn: 使用此函数，你可以创建一个给定大小的1D数组。

source: With this function you can create a custom, clickable, icon that acts as a "button" outside of the game canvas, but within the browser window itself.
zh_cn: 通过此函数，你可以创建一个自定义的、可点击的图标，充当游戏画布之外的"按钮"，但在浏览器窗口内。

source: With this function you can create a new DS grid data structure of the specified cell width and height.
zh_cn: 使用此函数，您可以创建指定单元格宽度和高度的新的DS网格数据结构。

source: With this function you can create a new array by mapping the current array elements using the given predicate.
zh_cn: 使用此函数，您可以创建新数组，其内容是使用给定条件映射当前数组元素来创建。

source: With this function you can create a new array from elements of the current array while the predicate is matched.
zh_cn: 使用此函数，您可以在匹配条件时从当前数组的元素创建一个新数组。

source: With this function you can create a new array with only the elements that return true to the given predicate.
zh_cn: 使用此函数，您可以创建一个新数组，其中只包含在给定条件返回true的元素。

source: With this function you can create a new array with only unique values.
zh_cn: 使用此函数，你可以创建一个只有唯一值的新数组。

source: With this function you can create a new array with the elements in reverse order.
zh_cn: 使用此函数，您可以用倒序的元素创建一个新数组。

source: With this function you can create a new instance of the specified object at any given point within the room and at the depth specified.
zh_cn: 使用此函数，您可以在房间内的任何给定点和指定深度处创建指定对象的新实例。

source: With this function you can create a new instance of the specified object at any given point within the room and on the layer specified.
zh_cn: 使用此函数，您可以在房间内的任何给定点和指定的层上创建指定对象的新实例。

source: With this function you can create a new keyframe data struct, supplying the type of track that the keyframe data will be applied to, which will be one of the following constants:
zh_cn: 使用此函数，你可以创建一个新的关键帧数据结构，提供关键帧数据将应用到的轨道类型，这将是以下常量之一:

source: With this function you can create a new particle type and the return value should be stored in a variable for use in all subsequent particle functions.
zh_cn: 使用此函数，您可以创建一个新的粒子类型，返回值应存储在一个变量中，供所有后续粒子函数使用。

source: With this function you can create a new sequence object which you can then add tracks to.
zh_cn: 通过此函数，您可以创建一个新的序列对象，然后向其添加轨道。

source: With this function you can create a new sequence track struct, supplying the type of track that you wish to make which will be one of the following constants:
zh_cn: 使用此函数，你可以创建一个新的序列轨道结构，提供你想要的轨道类型，它将是以下常量之一:

source: With this function you can create a new sound from the contents of a buffer.
zh_cn: 通过此函数，您可以从缓冲区的内容中创建新的声音。

source: With this function you can create a new sound index which can then be used in the regular audio functions to stream audio directly from an external OGG file source.
zh_cn: 使用此函数，您可以创建一个新的声音索引，然后在常规的音频函数中使用它来直接从外部OGG文件源流化音频。

source: With this function you can create a new string made up of two strings, where one has been inserted into the other at a given position.
zh_cn: 使用此函数，您可以创建一个由两个字符串组成的新字符串，其中一个字符串在给定的位置插入到另一个字符串中。

source: With this function you can create a new track keyframe struct, supplying the type of track that the keyframe will be applied to, which will be one of the following constants:
zh_cn: 使用此函数，你可以创建一个新的轨道关键帧结构，提供关键帧将被应用到的轨道类型，这将是以下常量之一:

source: With this function you can create a new vertex buffer.
zh_cn: 使用此函数，您可以创建一个新的顶点缓冲区。

source: With this function you can create a path in GameMaker without using the path editor.
zh_cn: 通过此函数，您可以在GameMaker中创建路径，而无需使用路径编辑器。

source: With this function you can create a path that will navigate from a start point to a finish point using an mp_grid that you have previously defined, avoiding any obstacles that have already been added into the grid.
zh_cn: 通过此函数，您可以创建一条路径，该路径将使用您之前定义的mp_grid从起点导航到终点，避开已经添加到网格中的任何障碍。

source: With this function you can create a simple effect above all instances of your room (it is actually created at a depth of -100000).
zh_cn: 通过此函数，您可以在房间的所有实例上创建一个简单的效果(它实际上是在-100000的深度创建的)。

source: With this function you can create a simple effect beneath all instances of your room (it is actually created at a depth of 100000).
zh_cn: 通过此函数，您可以在房间的所有实例下创建一个简单的效果(它实际上是在100000的深度创建的)。

source: With this function you can create a single particle anywhere within your game room, setting certain flags and properties.
zh_cn: 通过此函数，你可以在游戏房间的任何地方创建一个粒子，设置一些标志和属性。

source: With this function you can create a sprite from a previously initialised surface (the surface index ID value is returned when you create the surface using surface_create()).
zh_cn: 使用此函数，你可以从先前初始化的表面创建一个精灵(当你使用surface_create()创建表面时，表面索引ID值会返回)。

source: With this function you can create a string containing the given date, formatted as day/month/year.
zh_cn: 使用此函数，您可以创建一个包含给定日期的字符串，格式为日/月/年。

source: With this function you can create a string containing the given datetime, formatted for the system or device that is running the game when the function is called.
zh_cn: 使用此函数，您可以创建一个包含给定日期时间的字符串，该字符串的格式适用于调用此函数时运行游戏的系统或设备。

source: With this function you can create a string containing the given time, formatted for the system or device that is running the game when the function is called.
zh_cn: 通过此函数，你可以创建一个包含给定时间的字符串，该字符串是针对调用此函数时正在运行游戏的系统或设备进行格式化的。

source: With this function you can create an array of a given size, initialising each element with the provided function.
zh_cn: 使用此函数，您可以创建一个给定大小的数组，并使用提供的函数初始化每个元素。

source: With this function you can create an array of elements common to all the input arrays, removing duplicates.
zh_cn: 使用此函数，您可以创建所有输入数组共有的元素数组，删除重复项。

source: With this function you can create an empty GIF format image, ready to have data added to it.
zh_cn: 通过此函数，您可以创建一个空的GIF格式的图像，准备向其中添加数据。

source: With this function you can create an instance of a sequence asset on the given layer.
zh_cn: 使用此函数，您可以在给定的层上创建序列资源的实例。

source: With this function you can create an mp_grid for the motion planning functions.
zh_cn: 通过此函数，您可以为运动规划功能创建一个mp_grid。

source: With this function you can deactivate a single instance or all instances of a specific object from all those that have been activated previously.
zh_cn: 通过此函数，您可以从先前已激活的所有实例中，停用特定对象的单个实例或所有实例。

source: With this function you can deactivate all instances assigned to a specific layer.
zh_cn: 通过此函数，你可以停用分配给特定层的所有实例。

source: With this function you can decode a base64 encoded string (created using the buffer_base64_encode() function) into a buffer.
zh_cn: 使用此函数，您可以将base64编码的字符串(使用buffer_base64_encode()函数创建)解码到缓冲区中。

source: With this function you can decompress a previously compressed buffer using zlib compression.
zh_cn: 通过此函数，你可以使用zlib压缩来解压缩一个先前压缩过的缓冲区。

source: With this function you can define a region within the room to activate instances that have previously been deactivated.
zh_cn: 通过此函数，您可以在房间中定义一个区域来激活以前被停用的实例。

source: With this function you can define a region within the room to deactivate instances that have previously been activated.
zh_cn: 通过此函数，您可以在房间内定义一个区域来取消激活之前已激活的实例。

source: With this function you can define an area in room coordinates which will then clear the corresponding cells in the specified MP grid.
zh_cn: 通过此函数，您可以在房间坐标中定义一个区域，然后清除指定MP网格中的相应单元格。

source: With this function you can define an area within a given DS grid, then take those values and multiply them with those found in a separate region of either the same DS grid, or another one (which has been previously created).
zh_cn: 使用此函数，您可以在给定的DS网格中定义一个区域，然后将这些值与在相同DS网格或另一个(已经创建的)单独区域中找到的值相乘。

source: With this function you can delete (remove) a particle from the physics simulation in the current room.
zh_cn: 通过此函数，您可以从当前房间的物理模拟中删除一个粒子。

source: With this function you can delete (remove) a particle group from the physics simulation in the current room.
zh_cn: 通过此函数，您可以从当前房间的物理模拟中删除一个粒子组。

source: With this function you can delete (remove) all the particles that fall within the bounds of the defined circular area from the physics simulation in the current room.
zh_cn: 通过此函数，您可以从当前房间的物理模拟中删除(移除)所有落在定义的圆形区域边界内的粒子。

source: With this function you can delete (remove) all the particles that fall within the bounds of the defined polygonal area from the physics simulation in the current room.
zh_cn: 通过此函数，您可以从当前房间的物理模拟中删除(移除)所有落在定义的多边形区域边界内的粒子。

source: With this function you can delete (remove) all the particles that fall within the bounds of the defined rectangular area from the physics simulation in the current room.
zh_cn: 通过此函数，您可以从当前房间的物理模拟中删除落在已定义矩形区域边界内的所有粒子。

source: With this function you can delete a buffer previously have created using the function buffer_create() from memory, releasing the resources used to create it and removing any data that it may currently contain.
zh_cn: 通过此函数，您可以从内存中删除之前使用buffer_create()函数创建的缓冲区，释放用于创建该缓冲区的资源，并删除当前可能包含的任何数据。

source: With this function you can delete a font asset from the game.
zh_cn: 通过此函数，您可以从游戏中删除字体资源。
